#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Acquiring state lock. This may take a few moments...
data.google_secret_manager_secret_version.mongo_db_host: Reading...
google_secret_manager_secret.telegram_money_bot_chat_id: Refreshing state... [id=projects/keycode-mon/secrets/TELEGRAM_MONEY_BOT_CHAT_ID]
google_secret_manager_secret.google_oauth_verifier: Refreshing state... [id=projects/keycode-mon/secrets/GOOGLE_OAUTH_CODE_VERIFIER]
module.pubsub_money_management.google_pubsub_topic.topic[0]: Refreshing state... [id=projects/keycode-mon/topics/TOPIC_MONEY_MANAGEMENT]
google_secret_manager_secret.google_oauth_state: Refreshing state... [id=projects/keycode-mon/secrets/GOOGLE_OAUTH_STATE]
google_secret_manager_secret.google_token: Refreshing state... [id=projects/keycode-mon/secrets/GOOGLE_TOKEN]
google_secret_manager_secret.mongo_host: Refreshing state... [id=projects/keycode-mon/secrets/MONGO_DB_HOST]
data.google_secret_manager_secret_version.mongo_db_password: Reading...
google_secret_manager_secret.google_oauth_redirect_uri: Refreshing state... [id=projects/keycode-mon/secrets/GOOGLE_OAUTH_REDIRECT_URI]
google_pubsub_topic_iam_member.member: Refreshing state... [id=projects/keycode-mon/topics/TOPIC_MONEY_MANAGEMENT/roles/pubsub.publisher/allAuthenticatedUsers]
data.google_secret_manager_secret_version.telegram_money_bot_token: Reading...
google_secret_manager_secret.google_credentials: Refreshing state... [id=projects/keycode-mon/secrets/GOOGLE_CREDENTIALS]
data.google_secret_manager_secret_version.mongo_db_user: Reading...
google_secret_manager_secret.mongo_password: Refreshing state... [id=projects/keycode-mon/secrets/MONGO_DB_PASSWORD]
google_artifact_registry_repository.repository: Refreshing state... [id=projects/keycode-mon/locations/asia-southeast1/repositories/repository]
module.pubsub_money_management.data.google_project.project: Reading...
google_secret_manager_secret.telegram_money_bot_token: Refreshing state... [id=projects/keycode-mon/secrets/TELEGRAM_MONEY_BOT_TOKEN]
data.google_secret_manager_secret_version.telegram_money_bot_chat_id: Reading...
google_secret_manager_secret.mongo_user: Refreshing state... [id=projects/keycode-mon/secrets/MONGO_DB_USER]
module.pubsub_money_management.data.google_project.project: Read complete after 1s [id=projects/keycode-mon]
data.google_secret_manager_secret_version.mongo_db_host: Read complete after 1s [id=projects/646637604525/secrets/MONGO_DB_HOST/versions/1]
data.google_secret_manager_secret_version.mongo_db_password: Read complete after 1s [id=projects/646637604525/secrets/MONGO_DB_PASSWORD/versions/2]
data.google_secret_manager_secret_version.telegram_money_bot_token: Read complete after 1s [id=projects/646637604525/secrets/TELEGRAM_MONEY_BOT_TOKEN/versions/1]
data.google_secret_manager_secret_version.telegram_money_bot_chat_id: Read complete after 2s [id=projects/646637604525/secrets/TELEGRAM_MONEY_BOT_CHAT_ID/versions/1]
data.google_secret_manager_secret_version.mongo_db_user: Read complete after 2s [id=projects/646637604525/secrets/MONGO_DB_USER/versions/1]
google_cloud_run_v2_service.money_management_service: Refreshing state... [id=projects/keycode-mon/locations/asia-southeast1/services/money-management]
google_cloud_run_v2_service_iam_member.money_management_run_all_users: Refreshing state... [id=projects/keycode-mon/locations/asia-southeast1/services/money-management/roles/run.invoker/allUsers]
google_cloud_scheduler_job.scheduler_gmail_watch: Refreshing state... [id=projects/keycode-mon/locations/asia-southeast1/jobs/gmail-watch]
module.pubsub_money_management.google_pubsub_subscription.push_subscriptions["SUBSCRIPTION_PUSH_MONEY_MANAGEMENT"]: Refreshing state... [id=projects/keycode-mon/subscriptions/SUBSCRIPTION_PUSH_MONEY_MANAGEMENT]
module.pubsub_money_management.google_project_iam_member.token_creator_binding[0]: Refreshing state... [id=keycode-mon/roles/iam.serviceAccountTokenCreator/serviceAccount:service-646637604525@gcp-sa-pubsub.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_v2_service.money_management_service will be updated in-place
  ~ resource "google_cloud_run_v2_service" "money_management_service" {
        id                      = "projects/keycode-mon/locations/asia-southeast1/services/money-management"
        name                    = "money-management"
        # (30 unchanged attributes hidden)

      ~ traffic {
          - revision = "money-management-00066-s9j" -> null
          ~ type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_REVISION" -> "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_storage_bucket.money-management will be created
  + resource "google_storage_bucket" "money-management" {
      + effective_labels            = (known after apply)
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US-WEST1"
      + name                        = "money-management"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = (known after apply)
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # google_storage_bucket_iam_binding.money-management will be created
  + resource "google_storage_bucket_iam_binding" "money-management" {
      + bucket  = "money-management"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "allUsers",
        ]
      + role    = "roles/storage.objectViewer"
    }

  # google_storage_managed_folder.user-token will be created
  + resource "google_storage_managed_folder" "user-token" {
      + bucket         = "money-management"
      + create_time    = (known after apply)
      + id             = (known after apply)
      + metageneration = (known after apply)
      + name           = "user-token/"
      + self_link      = (known after apply)
      + update_time    = (known after apply)
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
*Pusher: @htthinh1999, Action: `pull_request`*